""" # Задача №47. Решение в группах: У вас есть код, который вы не можете менять (так часто бывает, когда код в глубине
# программы используется множество раз и вы не хотите ничего сломать):
# transformation = <???>
values = [2, 3, 5, 7, 11, 13, 17, 19, 23, 29] # или любой другой список
# Единственный способ вашего взаимодействия с этим кодом - посредством задания функции transformation. Однако вы поняли, что для вашей текущей 
# задачи вам не нужно никак преобразовывать список значений, а нужно получить его как есть.
# Напишите такое лямбда-выражение transformation, чтобы transformed_values получился копией values.

transormed_values = list(map(lambda x: x, values))
if values == transormed_values:
    print("yes")
else:
    print("no") """


""" # Задача №49. Решение в группах: Планеты вращаются вокруг звезд по эллиптическим орбитам. Назовем самой далекой планетой ту, орбита которой имеет
# самую большую площадь. Напишите функцию find_farthest_orbit(list_of_orbits), которая среди списка орбит планет найдет ту, по которой вращается
# самая далекая планета. Круговые орбиты не учитывайте: вы знаете, что у вашей звезды таких планет нет, зато искусственные спутникибыли были запущены 
# на круговые орбиты. Результатом функции должен быть кортеж, содержащий длины полуосей эллипса орбиты самой далекой планеты. Каждая орбита представляет 
# из себя кортеж из пары чисел - полуосей ее эллипса. Площадь эллипса вычисляется по формуле S = pi*a*b, где a и b - длины полуосей эллипса. При решении
# задачи используйте списочные выражения. Подсказка: проще всего будет найти эллипс в два шага: сначала вычислить самую большую площадь эллипса,
# а затем найти и сам эллипс, имеющий такую площадь. Гарантируется, что самая далекая планета ровно одна

# Ввод:                                                                       Вывод:
orbits = [(1, 3), (2.5, 10), (7, 2), (6, 6), (4, 3)]                                #2.5 10

# -------------------------------------------------------       1 Вариант       ----------------------------------------------------------------
# def find_farthest_orbit(list_of_orbits):
#     orb = list(filter(lambda x: x[0] != x[1], list_of_orbits))
#     for i, j in orb:
#         if i * j == max(list(map(lambda x: x[0] * x[1], orb))):
#             return i, j
            
# print(*find_farthest_orbit(orbits))


# -------------------------------------------------------       Решение Сенсея       ----------------------------------------------------------------

print(max(orbits, key = lambda x: x[0] * x[1] * (x[0] != x[1]))) """


""" # Задача №51. Общее обсуждение: Напишите функцию same_by(characteristic, objects), которая проверяет, все ли объекты имеют одинаковое значение
# некоторой характеристики, и возвращают True, если это так. Если значение характеристики для разных объектов отличается - то False. Для пустого
# набора объектов, функция должна возвращать True. Аргумент characteristic - это функция, которая принимает объект и вычисляет его характеристику.

# values = [0, 2, 10, 6] 
# def same_by(characteristic, objects):
#     return len(list(filter(characteristic, objects))) == 0

# if same_by(lambda x: x % 2, values):
#     print('same')
# else:
#     print('different')

# ----------------------

# values = [0, 2, 10, 1, 6] 
# if len(list(filter(lambda x: x % 2, values))) == 0:
#     print("same")
# else: print("different") """


""" numbers ='2 12 -4 77 -38 8'
# вывод: 12 77 -38
numbers = list(map(int, numbers.split()))
print(*list(filter(lambda x: abs(x) in range(10, 100), numbers))) """

